Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/teachers_and_schools/green_schools_environmental_initiative.html.txt.tmx
Source language: en
Languages: ga

source: Flag initiatives for schools
ga: Tionscnaimh bhratach do scoileanna

source: A number of educational initiatives award flags to schools that successfully participate in their programmes
ga: Bronnann roinnt tionscnaimh oideachais bratacha ar scoileanna a ghlacann páirt rathúil ina gcuid clár

source: The individual programmes are sometimes known by the colour of the flag they award
ga: Uaireanta, aithnítear na cláir ar leith trí thagairt a dhéanamh don dath atá ar an mbratach a bhronnann siad

source: The Green-Schools award is called the Green Flag, the Active School Flag is known as the Blue Flag and the Yellow Flag is given to schools that participate in the Diversity in Schools Programme
ga: Tugtar an Bhratach Ghlas ar dhámhachtain na Scoileanna Glasa, tugtar an Bhratach Ghorm ar an mBratach Scoile Gníomhaí agus is í an Bhratach Bhuí a thugtar do scoileanna a ghlacann páirt sa Chlár um Ilchineálacht i Scoileanna

source: These awards are open to both primary schools and post-primary schools
ga: Tá na dámhachtainí sin ar oscailt do bhunscoileanna agus d’iar-bhunscoileanna araon

source: Green-Schools is the Irish branch of an international environmental education programme and award scheme known as Eco-Schools
ga: Is ionann Scoileanna Glasa agus an chraobh Éireannach de chlár agus de scéim dámhachtana idirnáisiúnta um oideachas comhshaoil, rud ar a dtugtar Éiceascoileanna

source: It is designed to raise students' awareness of environmental and sustainable development issues through classroom study
ga: Is é is aidhm d’Éiceascoileanna ná feasacht daltaí ar shaincheisteanna comhshaoil agus forbartha inbhuanaithe a ardú trí staidéar sa seomra ranga

source: Green-Schools is run by An Taisce, in conjunction with local authorities
ga: Tá Scoileanna Glasa á reáchtáil ag An Taisce, i gcomhar le húdaráis áitiúla

source: The scheme offers a way to take environmental issues from the curriculum and apply them to the day-to-day running of the school, for example reduce litter, waste and fuel bills
ga: Fágann an scéim gur féidir saincheisteanna comhshaoil a thógáil ón gcuraclam agus iad a chur i bhfeidhm i reáchtáil laethúil na scoile, mar shampla, bruscar, dramhaíl agus billí breosla a laghdú

source: This process helps students to recognise the importance of environmental issues and take them more seriously in their personal and home lives
ga: Cabhraíonn an próiseas sin le daltaí an tábhacht a bhaineann le saincheisteanna comhshaoil a aithint agus na saincheisteanna sin a ghlacadh dáiríre ina saol pearsanta agus baile

source: The Green-Schools award is given to schools that successfully complete the programme
ga: Tugtar dámhachtain na Scoileanna Glasa do scoileanna a n-éiríonn leo an clár a chur i gcrích

source: A Green-Schools award is in the form of a Green Flag that can be flown outside the school or displayed in a foyer
ga: Tugtar dámhachtain na Scoileanna Glasa i bhfoirm Brataí Glaise, rud is féidir a chur ar foluain taobh amuigh den scoil nó a chur ar taispeáint san fhorhalla

source: Award winners also receive a certificate, a logo to display on headed notepaper and other publicity material
ga: Chomh maith leis sin, faigheann buaiteoirí na dámhachtana teastas, lógó is féidir a chur ar taispeáint ar pháipéar nótaí ceannteidil agus ábhar eile poiblíochta

source: The Active School Flag (ASF) is awarded by the Department of Education and Skills (DES) to schools that strive to achieve a physical educated and physically active school community
ga: Bronnann an Roinn Oideachais agus Scileanna (ROS) an Bhratach Scoile Gníomhaí (BSG) ar scoileanna a fhéachann le pobal scoile atá oilte agus gníomhach go fisiciúil a bhaint amach

source: The initiative is open to primary and post primary schools, special schools and Youthreach centres
ga: Tá an tionscnamh ar oscailt do bhunscoileanna, d’iar-bhunscoileanna, do scoileanna speisialta agus d’ionaid Ógtheagmhála

source: The Active School Flag is awarded to schools that:
ga: Bronntar an Bhratach Scoile Gníomhaí ar scoileanna a dhéanann na nithe seo a leanas:

source: • Adhere to DES guidelines regarding physical education (PE) timetable provision for all students
ga: • Cloí le treoirlínte ó ROS maidir le corpoideachas a sholáthar san amchlár do gach dalta

source: • Teach a broad and balanced PE curriculum
ga: • Curaclaim corpoideachais atá leathan agus cothrom a theagasc

source: • Inform and invite the whole school community to participate in the ASF process
ga: • Eolas a chur ar phobal na scoile uile faoi phróiseas na Brataí Scoile Gníomhaí agus cuireadh a thabhairt dó páirt a ghlacadh ann

source: • Self-evaluate current provision in terms of PE, physical activity and community links
ga: • Féinmheasúnú a dhéanamh ar an soláthar reatha ó thaobh corpoideachais, gníomhaíocht fhisiciúil agus naisc phobail de

source: • Plan and implement improvements for each of the above areas
ga: • Feabhsuithe a phleanáil agus a chur i bhfeidhm i ngach ceann de na réimsí thuasluaite

source: • Organise an Active School Week as part of the annual school calendar
ga: • Seachtain Scoile Gníomhaí a eagrú mar chuid den fhéilire bhliantúil scoile

source: The ASF is a whole-school process
ga: Próiseas scoile uile is ea an Bhratach Scoile Gníomhaí

source: It also helps schools to forge closer working links with parents, the local community and outside agencies to help promote physical activity and sport
ga: Cabhraíonn sí freisin le naisc oibre níos dlúithe a chruthú le tuismitheoirí, leis an bpobal áitiúil agus le gníomhaireachtaí seachtracha chun cabhrú le gníomhaíocht fhisiciúil agus le spórt a chur chun cinn

source: It is non-competitive and schools should work to their own time frame to plan and implement improvements that will have an effect on their school community
ga: Is rud neamhiomaíoch é agus ba chóir do scoileanna gabháil ar a luas féin agus feabhsuithe a mbeidh tionchar acu ar a bpobal scoile á bpleanáil agus á gcur i bhfeidhm acu

source: Each of the steps of the ASF process is described in more detail in the ASF Guidelines Booklets
ga: Tá gach ceann de na céimeanna de phróiseas na Brataí Scoile Gníomhaí leagtha amach níos mine i Leabhráin Treoirlínte na Brataí Scoile Gníomhaí

source: An Active School Flag (Blue Flag) is awarded to schools that successfully complete the ASF process
ga: Bronntar Bratach Scoile Gníomhaí (Bratach Ghorm) ar scoileanna a n-éiríonn leo próiseas na Brataí Scoile Gníomhaí a chur i gcrích

source: The Yellow Flag is part of the Diversity in Schools Programme
ga: Tá an Bhratach Bhuí mar chuid den Chlár um Ilchineálacht i Scoileanna

source: This programme provides a series of steps that brings issues of interculturalism, equality and diversity into the whole-school programme and allows schools to apply them to the running of the school
ga: Soláthraíonn an clár sin sraith céimeanna lena ndéantar saincheisteanna a bhaineann le hidirchultúrachas, le comhionannas agus le hilchineálacht a chur isteach i gclár na scoile eile agus lena gcuirtear ar chumas scoileanna na saincheisteanna sin a chur i bhfeidhm i reáchtáil na scoile

source: It also works with students, staff, management, parents and wider community groups so that issues of diversity and equality can be understood and taken outside the school setting
ga: Chomh maith leis sin, oibríonn an clár le daltaí, leis an bhfoireann, leis an lucht bainistíochta, le tuismitheoirí agus le grúpaí sa mhórphobal chun gur féidir saincheisteanna a bhaineann le hilchineálacht agus le comhionannas a thuiscint agus a phlé lasmuigh den timpeallacht scoile

source: It can involve training for staff and setting up a diversity committee
ga: Is féidir oiliúint a chur ar an bhfoireann agus coiste ilchineálachta a bhunú mar chuid den chlár

source: If a school successfully participates in the programme, the school is awarded a Yellow Flag in recognition of its work in promoting diversity and inclusion
ga: Má éiríonn le scoil páirt a ghlacadh sa chlár, bronntar Bratach Bhuí ar an scoil chun aitheantas a thabhairt dá cuid oibre maidir le hilchineálacht agus le cuimsiú a chur chun cinn

source: The award is publicised locally, and the school can fly the Yellow Flag and use the logo on its official correspondence
ga: Déantar an dámhachtain a phoibliú ar bhonn áitiúil, agus is féidir leis an scoil an Bhratach Bhuí a chur ar foluain agus lógó na Brataí Buí a úsáid ina comhfhreagras oifigiúil

source: A Green-Schools award must be renewed every 2 years
ga: Ní mór dámhachtain Scoileanna Glasa a athnuachan gach 2 bhliain

source: Active School Flag must be renewed every 3 years
ga: Ní mór Bratach Scoile Gníomhaí a athnuachan gach 3 bliana

source: The Yellow Flag must be renewed every 2 years
ga: Ní mór Bratach Bhuí a athnuachan gach 2 bhliain

source: Schools can register for the Green-Schools programme on the Green-Schools website
ga: Is féidir le scoileanna clárú do chlár na Scoileanna Glasa ar láithreán Gréasáin na Scoileanna Glasa

source: Schools can register for the Active School Flag on the Active School Flag website
ga: Is féidir le scoileanna clárú don Bhratach Scoile Gníomhaí ar láithreán Gréasáin na Brataí Scoile Gníomhaí

source: Schools can find out more about the application criteria for Yellow Flag on the Yellow Flag website
ga: Is féidir le scoileanna tuilleadh faisnéise a fháil faoi na critéir iarratais don Bhratach Bhuí ar láithreán Gréasáin na Brataí Buí
